profiling/report-after/statistics.json
{
  "GET /topup - SUCCESS filter" : {
    "transaction" : "GET /topup - SUCCESS filter",
    "sampleCount" : 1376,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 33.10901162790693,
    "medianResTime" : 29.0,
    "minResTime" : 18.0,
    "maxResTime" : 212.0,
    "pct1ResTime" : 45.0,
    "pct2ResTime" : 59.0,
    "pct3ResTime" : 106.84000000000015,
    "throughput" : 7.79559231771571,
    "receivedKBytesPerSec" : 52.200394320789194,
    "sentKBytesPerSec" : 3.532377768964931
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 11036,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 42.374320405944175,
    "medianResTime" : 37.0,
    "minResTime" : 16.0,
    "maxResTime" : 1691.0,
    "pct1ResTime" : 60.0,
    "pct2ResTime" : 77.0,
    "pct3ResTime" : 131.0,
    "throughput" : 61.391602323045774,
    "receivedKBytesPerSec" : 421.04532061828286,
    "sentKBytesPerSec" : 27.849007718105405
  },
  "GET /topup - admin latest" : {
    "transaction" : "GET /topup - admin latest",
    "sampleCount" : 1376,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 29.349563953488413,
    "medianResTime" : 25.0,
    "minResTime" : 16.0,
    "maxResTime" : 456.0,
    "pct1ResTime" : 40.0,
    "pct2ResTime" : 54.0,
    "pct3ResTime" : 91.23000000000002,
    "throughput" : 7.792325465500839,
    "receivedKBytesPerSec" : 52.17113053313154,
    "sentKBytesPerSec" : 3.41675208399402
  },
  "GET /payrolls/me - ACCEPTED filter" : {
    "transaction" : "GET /payrolls/me - ACCEPTED filter",
    "sampleCount" : 1379,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 51.1493836113126,
    "medianResTime" : 45.0,
    "minResTime" : 29.0,
    "maxResTime" : 658.0,
    "pct1ResTime" : 68.0,
    "pct2ResTime" : 87.0,
    "pct3ResTime" : 147.20000000000005,
    "throughput" : 7.776198854152569,
    "receivedKBytesPerSec" : 48.29547507098107,
    "sentKBytesPerSec" : 3.5767477151424414
  },
  "GET /payrolls/me - latest" : {
    "transaction" : "GET /payrolls/me - latest",
    "sampleCount" : 1381,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 42.64083997103547,
    "medianResTime" : 37.0,
    "minResTime" : 24.0,
    "maxResTime" : 639.0,
    "pct1ResTime" : 59.0,
    "pct2ResTime" : 78.0,
    "pct3ResTime" : 131.0,
    "throughput" : 7.773974916124383,
    "receivedKBytesPerSec" : 47.09091748278861,
    "sentKBytesPerSec" : 3.454256432457612
  },
  "GET /payrolls - admin status filter" : {
    "transaction" : "GET /payrolls - admin status filter",
    "sampleCount" : 1377,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 45.29484386347132,
    "medianResTime" : 40.0,
    "minResTime" : 26.0,
    "maxResTime" : 655.0,
    "pct1ResTime" : 62.0,
    "pct2ResTime" : 75.0,
    "pct3ResTime" : 110.44000000000005,
    "throughput" : 7.776541613251182,
    "receivedKBytesPerSec" : 60.13068976392238,
    "sentKBytesPerSec" : 3.554122534181204
  },
  "GET /payrolls - admin latest" : {
    "transaction" : "GET /payrolls - admin latest",
    "sampleCount" : 1378,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 39.46153846153847,
    "medianResTime" : 34.0,
    "minResTime" : 20.0,
    "maxResTime" : 664.0,
    "pct1ResTime" : 55.0,
    "pct2ResTime" : 75.0,
    "pct3ResTime" : 145.21000000000004,
    "throughput" : 7.7755144648268,
    "receivedKBytesPerSec" : 60.06190823143722,
    "sentKBytesPerSec" : 3.4321606817399544
  },
  "GET /wallets/me/transactions - CREDIT filter" : {
    "transaction" : "GET /wallets/me/transactions - CREDIT filter",
    "sampleCount" : 1384,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 51.94725433526018,
    "medianResTime" : 44.0,
    "minResTime" : 27.0,
    "maxResTime" : 707.0,
    "pct1ResTime" : 73.5,
    "pct2ResTime" : 96.0,
    "pct3ResTime" : 154.75000000000045,
    "throughput" : 7.782363724288397,
    "receivedKBytesPerSec" : 53.57128815094356,
    "sentKBytesPerSec" : 3.72398264150519
  },
  "GET /wallets/me/transactions - latest" : {
    "transaction" : "GET /wallets/me/transactions - latest",
    "sampleCount" : 1385,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 45.94512635379064,
    "medianResTime" : 39.0,
    "minResTime" : 25.0,
    "maxResTime" : 1691.0,
    "pct1ResTime" : 63.0,
    "pct2ResTime" : 80.70000000000005,
    "pct3ResTime" : 133.2800000000002,
    "throughput" : 7.7058319516619,
    "receivedKBytesPerSec" : 52.93157396833654,
    "sentKBytesPerSec" : 3.514280782642683
  }
}