profiling/report-before/statistics.json
{
  "GET /topup - SUCCESS filter" : {
    "transaction" : "GET /topup - SUCCESS filter",
    "sampleCount" : 1147,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 97.72885789014806,
    "medianResTime" : 88.0,
    "minResTime" : 45.0,
    "maxResTime" : 379.0,
    "pct1ResTime" : 138.20000000000005,
    "pct2ResTime" : 158.0,
    "pct3ResTime" : 223.3199999999997,
    "throughput" : 6.530105665877209,
    "receivedKBytesPerSec" : 43.72671345887798,
    "sentKBytesPerSec" : 2.9589541298506106
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 9204,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 72.00097783572326,
    "medianResTime" : 61.0,
    "minResTime" : 23.0,
    "maxResTime" : 1746.0,
    "pct1ResTime" : 116.0,
    "pct2ResTime" : 139.0,
    "pct3ResTime" : 206.0,
    "throughput" : 51.18508714366749,
    "receivedKBytesPerSec" : 351.05554209673113,
    "sentKBytesPerSec" : 23.21855574977199
  },
  "GET /topup - admin latest" : {
    "transaction" : "GET /topup - admin latest",
    "sampleCount" : 1149,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 106.09051348999145,
    "medianResTime" : 96.0,
    "minResTime" : 48.0,
    "maxResTime" : 673.0,
    "pct1ResTime" : 146.0,
    "pct2ResTime" : 179.0,
    "pct3ResTime" : 233.5,
    "throughput" : 6.5109848077021155,
    "receivedKBytesPerSec" : 43.59234750327249,
    "sentKBytesPerSec" : 2.854914236970947
  },
  "GET /payrolls/me - ACCEPTED filter" : {
    "transaction" : "GET /payrolls/me - ACCEPTED filter",
    "sampleCount" : 1151,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 68.33709817549958,
    "medianResTime" : 58.0,
    "minResTime" : 32.0,
    "maxResTime" : 386.0,
    "pct1ResTime" : 103.0,
    "pct2ResTime" : 126.39999999999986,
    "pct3ResTime" : 181.44000000000005,
    "throughput" : 6.492883776816287,
    "receivedKBytesPerSec" : 40.32514902148406,
    "sentKBytesPerSec" : 2.9864729090629605
  },
  "GET /payrolls/me - latest" : {
    "transaction" : "GET /payrolls/me - latest",
    "sampleCount" : 1151,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 58.228496959165845,
    "medianResTime" : 48.0,
    "minResTime" : 28.0,
    "maxResTime" : 430.0,
    "pct1ResTime" : 88.79999999999995,
    "pct2ResTime" : 113.0,
    "pct3ResTime" : 223.52000000000044,
    "throughput" : 6.49163870167226,
    "receivedKBytesPerSec" : 39.32308557288288,
    "sentKBytesPerSec" : 2.884468368418826
  },
  "GET /payrolls - admin status filter" : {
    "transaction" : "GET /payrolls - admin status filter",
    "sampleCount" : 1149,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 60.58224543080934,
    "medianResTime" : 52.0,
    "minResTime" : 33.0,
    "maxResTime" : 565.0,
    "pct1ResTime" : 92.0,
    "pct2ResTime" : 115.0,
    "pct3ResTime" : 163.0,
    "throughput" : 6.507223641213549,
    "receivedKBytesPerSec" : 50.31574670957621,
    "sentKBytesPerSec" : 2.9740045547733795
  },
  "GET /payrolls - admin latest" : {
    "transaction" : "GET /payrolls - admin latest",
    "sampleCount" : 1151,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 52.65855777584714,
    "medianResTime" : 43.0,
    "minResTime" : 23.0,
    "maxResTime" : 440.0,
    "pct1ResTime" : 85.0,
    "pct2ResTime" : 108.39999999999986,
    "pct3ResTime" : 172.8800000000001,
    "throughput" : 6.496071880079465,
    "receivedKBytesPerSec" : 50.17893431051901,
    "sentKBytesPerSec" : 2.8674067283163267
  },
  "GET /wallets/me/transactions - CREDIT filter" : {
    "transaction" : "GET /wallets/me/transactions - CREDIT filter",
    "sampleCount" : 1152,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 68.8845486111112,
    "medianResTime" : 59.0,
    "minResTime" : 32.0,
    "maxResTime" : 334.0,
    "pct1ResTime" : 107.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 199.82000000000016,
    "throughput" : 6.476348958274773,
    "receivedKBytesPerSec" : 44.58106798444721,
    "sentKBytesPerSec" : 3.099034169486952
  },
  "GET /wallets/me/transactions - latest" : {
    "transaction" : "GET /wallets/me/transactions - latest",
    "sampleCount" : 1154,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 63.65077989601381,
    "medianResTime" : 51.0,
    "minResTime" : 31.0,
    "maxResTime" : 1746.0,
    "pct1ResTime" : 100.0,
    "pct2ResTime" : 121.25,
    "pct3ResTime" : 219.35000000000014,
    "throughput" : 6.42027784113985,
    "receivedKBytesPerSec" : 44.101041573941686,
    "sentKBytesPerSec" : 2.927997804504209
  }
}